insert into executor (name) values 
('В. Цой'),('Бьянка'),('Хелависа'),
('Джеймс Хэтфилд'),('Иван Кучин'),('М.Шуфутинский'),
('B.М.Вакуленко'),('Noize MC');

insert into genre (name) values
('рок'),('поп'),('метал'),('фолк'),('шансон'),('рэп');

insert into album (name, year_of_issure) values
('Дикие травы','2009'),('Дорога сна','2003'),
('Звезда по имени Солнце','1989'),('Группа крови','1988'),
('Lulu','1996'),('Load','2011'),
('Наше поколение','2011'),('Мысли в нотах','2016'),
('Крестовая печать','2010'),('Небесные цветы','2012'),
('Наколочка','2002'),('Nintendo','2011'),
('Новый альбом','2010');

insert into list_track (name,album_id, duration) values
('Песня без слов',3,'300'),
('Сказка',3,'359'),
('Прохожий',4,'218'),
('Спокойная ночь',4,'364'),
('Далеко',1,'254'),
('Волкодав',1,'301'),
('Ольга',2,'280'),
('Горец',2,'205'),
('The View',5,'321'),
('Dragon',5,'660'),
('2 X 4',6,'328'),
('The House Jack Built',6,'399'),
('Сучка подруга',7,'184'),
('А Чё Чё',7,'184'),
('Кеды',8,'180'),
('Лети',8,'218'),
('Колечко',9,'232'),
('Боль',9,'266'),
('Верба',10,'200'),
('Караван',10,'238'),
('Поезда',11,'289'),
('Интро',12,'127'),
('Вьетнам',13,'242');

insert into compilation (name, year_of_issure) values
('Сборник 1',2016),
('Сборник 2',2017),
('Сборник 3',2018),
('Сборник 4',2019),
('Сборник 5',2020),
('Сборник 6',2021),
('Сборник 7',2022);

insert into track_compilation (list_track_id, compilation_id) values
(1,1),(3,1),(4,1),(6,1),(7,1),(8,1),(9,1),(10,1),
(11,2),(12,2),(13,2),(14,2),(15,2),(16,2),(17,2),(18,2),(20,2),
(21,3),(22,3),(23,3),(10,3),(3,3),(7,3),(1,3),(9,3),(14,3),
(1,4),(12,4),(23,4),(14,4),(16,4),(7,4),(18,4),(3,4),(10,4),
(7,5),(9,5),(11,5),(13,5),(15,5),(17,5),(21,5),
(1,6),(3,6),(6,6),(9,6),(12,6),(15,6),(18,6),(21,6),(23,6),(4,6),
(4,7),(8,7),(12,7),(16,7),(20,7),(23,7),(6,7),(9,7);

insert into album_executor (album_id, executor_id) values
(3,1),(4,1),
(3,3),(4,3),
(7,2),(8,2),
(1,3),(2,3),
(5,4),(6,4),
(9,5),(10,5),
(11,6),
(12,7),
(13,8);

insert into executor_genre (executor_id, genre_id) values
(1,1),
(2,2),
(3,4),
(4,3),
(5,5),
(6,5),
(7,6),
(8,6);


